Updated Data Pipeline section
